---
kind: method
id: M:Autodesk.Revit.DB.Structure.PathReinforcement.IsValidAlternatingBarOrientation(Autodesk.Revit.DB.Structure.ReinforcementBarOrientation)
source: html/8bf22e76-2e49-688a-0701-fafddc316572.htm
---
# Autodesk.Revit.DB.Structure.PathReinforcement.IsValidAlternatingBarOrientation Method

Checks if orientation for alternating bars is valid.

## Syntax (C#)
```csharp
public bool IsValidAlternatingBarOrientation(
	ReinforcementBarOrientation orientation
)
```

## Parameters
- **orientation** (`Autodesk.Revit.DB.Structure.ReinforcementBarOrientation`) - An orientation.

## Returns
True if orientation for alternating bars are valid.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration